tangyangguang/Esp32_Irrigation/firmware/test/test_record_store_device/test_main.cpp
void captureEvent(const Esp32BaseAppEvents::EventRecord& event, void* user) {
    EventCapture* capture = static_cast<EventCapture*>(user);
    if (capture && capture->eventCode == 0) {
        capture->eventCode = event.eventCode;
        capture->reasonCode = event.reasonCode;
        capture->objectId = event.objectId;
        capture->value1 = event.value1;
        capture->value2 = event.value2;
        capture->flags = event.flags;
        capture->level = event.level;
        capture->eventKind = event.eventKind;
        capture->conditionId = event.conditionId;
    }
}

void test_irrigation_event_mapping_and_latest_read() {
    TEST_ASSERT_TRUE(Esp32BaseAppEvents::clearEventHistory());
    TEST_ASSERT_TRUE(Esp32BaseAppEvents::forgetAllConditionStates());
    // This integration case drives filesystem-backed event persistence from the
    // Arduino loop task. Keep its presentation fixtures out of the loopTask
    // stack so the test exercises production code instead of exhausting the
    // comparatively small test-runner stack before that code is entered.
    static IrrigationEvents events;
    static WateringSessionSummary summary{};
    summary = {};
    summary.purpose = WateringPurpose::Normal;
    summary.source = WateringSource::AutomaticPlan;
    summary.planId = 3;
    summary.result = WateringResult::Failed;
    summary.stopReason = WateringStopReason::NoFlowTimeout;
    summary.zoneCount = 1;
    summary.zones[0].zoneId = 2;
    summary.zones[0].result = ZoneWateringResult::Failed;
    summary.zones[0].pulseCount = 37;
    summary.zones[0].actualWateringSec = 18;
    events.syncStorageStatus();
    events.recordAbnormalWateringStop(summary);

    static EventCapture capture;
    capture = {};
    TEST_ASSERT_TRUE(Esp32BaseAppEvents::readLatest(0, 1, captureEvent, &capture));
    TEST_ASSERT_EQUAL_UINT32(
        static_cast<uint32_t>(IrrigationEvents::EventCode::WateringStoppedAbnormally),
        capture.eventCode);
    TEST_ASSERT_EQUAL_UINT32(
        static_cast<uint32_t>(IrrigationEvents::ReasonCode::NoFlowTimeout),
        capture.reasonCode);
    TEST_ASSERT_EQUAL_UINT32(2, capture.objectId);
    TEST_ASSERT_EQUAL_INT32(37, capture.value1);
    TEST_ASSERT_EQUAL_INT32(18, capture.value2);
    TEST_ASSERT_EQUAL_UINT8(
        (1U << 7U) | (1U << 2U) | (3U << 3U), capture.flags);
    TEST_ASSERT_EQUAL(static_cast<int>(Esp32BaseAppEvents::Level::Error),
                      static_cast<int>(capture.level));
    static Esp32BaseAppEvents::EventRecord wateringPresentation{};
    wateringPresentation = {};
    wateringPresentation.eventCode = capture.eventCode;
    wateringPresentation.reasonCode = capture.reasonCode;
    wateringPresentation.objectId = capture.objectId;
    wateringPresentation.flags = capture.flags;
    static char wateringTitle[96]{};
    wateringTitle[0] = '\0';
    IrrigationEvents::formatTitle(wateringPresentation,
                                  wateringTitle,
                                  sizeof(wateringTitle),
                                  "晚间花园",
                                  "菜地");
    TEST_ASSERT_EQUAL_STRING(
        "自动计划“晚间花园”失败：菜地浇水时水流中断",
        wateringTitle);
    TEST_ASSERT_EQUAL(
        static_cast<int>(WateringSource::AutomaticPlan),
        static_cast<int>(IrrigationEvents::wateringSource(
            wateringPresentation)));
    TEST_ASSERT_TRUE(
        IrrigationEvents::hasWateringContext(wateringPresentation));
    TEST_ASSERT_EQUAL_UINT8(
        3, IrrigationEvents::wateringPlanId(wateringPresentation));

    summary.source = WateringSource::SingleOutput;
    summary.planId = 0;
    summary.stopReason = WateringStopReason::TargetVolumeTimeout;
    events.recordAbnormalWateringStop(summary);
    static EventCapture singleOutputCapture;
    singleOutputCapture = {};
    TEST_ASSERT_TRUE(Esp32BaseAppEvents::readLatest(
        0, 1, captureEvent, &singleOutputCapture));
    TEST_ASSERT_EQUAL_UINT32(
        static_cast<uint32_t>(IrrigationEvents::ReasonCode::TargetVolumeTimeout),
        singleOutputCapture.reasonCode);
    TEST_ASSERT_EQUAL_UINT8((1U << 7U) | (1U << 3U),
                            singleOutputCapture.flags);
    static Esp32BaseAppEvents::EventRecord singleOutputPresentation{};
    singleOutputPresentation = {};
    singleOutputPresentation.eventCode = singleOutputCapture.eventCode;
    singleOutputPresentation.reasonCode = singleOutputCapture.reasonCode;
    singleOutputPresentation.objectId = singleOutputCapture.objectId;
    singleOutputPresentation.flags = singleOutputCapture.flags;
    static char singleOutputTitle[96]{};
    singleOutputTitle[0] = '\0';
    IrrigationEvents::formatTitle(singleOutputPresentation,
                                  singleOutputTitle,
                                  sizeof(singleOutputTitle),
                                  nullptr,
                                  "菜地");
    TEST_ASSERT_EQUAL_STRING(
        "单次出水未完成：菜地达到最长运行时间",
        singleOutputTitle);
    TEST_ASSERT_EQUAL(
        static_cast<int>(WateringSource::SingleOutput),
        static_cast<int>(IrrigationEvents::wateringSource(
            singleOutputPresentation)));
    TEST_ASSERT_EQUAL_UINT8(
        0, IrrigationEvents::wateringPlanId(singleOutputPresentation));

    WateringStatus busyStatus{};
    busyStatus.active = true;
    busyStatus.purpose = WateringPurpose::Normal;
    busyStatus.source = WateringSource::ManualZones;
    events.recordAutomaticPlanSkipped(
        2, "自动计划 2", WateringStartResult::Busy, busyStatus);
    static EventCapture skippedCapture;
    skippedCapture = {};
    TEST_ASSERT_TRUE(Esp32BaseAppEvents::readLatest(
        0, 1, captureEvent, &skippedCapture));
    TEST_ASSERT_EQUAL_UINT32(
        static_cast<uint32_t>(
            IrrigationEvents::ReasonCode::PlanBusyManualWatering),
        skippedCapture.reasonCode);
    static Esp32BaseAppEvents::EventRecord skippedPresentation{};
    skippedPresentation = {};
    skippedPresentation.eventCode = skippedCapture.eventCode;
    skippedPresentation.reasonCode = skippedCapture.reasonCode;
    skippedPresentation.objectId = skippedCapture.objectId;
    static char skippedTitle[128]{};
    static char skippedSummary[160]{};
    skippedTitle[0] = '\0';
    skippedSummary[0] = '\0';
    IrrigationEvents::formatTitle(skippedPresentation,
                                  skippedTitle,
                                  sizeof(skippedTitle),
                                  "午后花园");
    IrrigationEvents::formatSummary(
        skippedPresentation, skippedSummary, sizeof(skippedSummary));
    TEST_ASSERT_EQUAL_STRING(
        "自动计划“午后花园”未执行：设备正在手动浇水",
        skippedTitle);
    TEST_ASSERT_EQUAL_STRING(
        "到达启动时间时设备正在手动浇水，本次已跳过且不会补执行。",
        skippedSummary);
    TEST_ASSERT_EQUAL_UINT8(
        2, IrrigationEvents::wateringPlanId(skippedPresentation));

    const uint32_t afterWateringEvent = Esp32BaseAppEvents::eventCount();
    summary.purpose = WateringPurpose::FlowCalibration;
    events.recordAbnormalWateringStop(summary);
    TEST_ASSERT_EQUAL_UINT32(afterWateringEvent, Esp32BaseAppEvents::eventCount());

