tangyangguang/Esp32_Irrigation/firmware/test/test_record_store_device/test_main.cpp
    events.observeRtcRollback(Esp32BaseAppEvents::ObservedConditionState::Active);
    const uint32_t afterActivation = Esp32BaseAppEvents::eventCount();
    TEST_ASSERT_EQUAL_UINT32(afterWateringEvent + 1U, afterActivation);
    events.observeRtcRollback(Esp32BaseAppEvents::ObservedConditionState::Active);
    TEST_ASSERT_EQUAL_UINT32(afterActivation, Esp32BaseAppEvents::eventCount());
    events.observeRtcRollback(Esp32BaseAppEvents::ObservedConditionState::Inactive);
    TEST_ASSERT_EQUAL_UINT32(afterActivation + 1U, Esp32BaseAppEvents::eventCount());

    TEST_ASSERT_TRUE(Esp32BaseAppEvents::clearEventHistory());
    events.observeRtcRollback(Esp32BaseAppEvents::ObservedConditionState::Active);
    TEST_ASSERT_EQUAL_UINT32(1U, Esp32BaseAppEvents::eventCount());
    TEST_ASSERT_TRUE(Esp32BaseAppEvents::clearEventHistory());
    TEST_ASSERT_TRUE(events.resetConditionHistory());
    TEST_ASSERT_EQUAL(
        static_cast<int>(IrrigationEvents::ConditionDisplayState::Unknown),
        static_cast<int>(events.conditionState(3)));
    events.observeRtcRollback(Esp32BaseAppEvents::ObservedConditionState::Active);
    TEST_ASSERT_EQUAL_UINT32(1U, Esp32BaseAppEvents::eventCount());

    static EventCapture recoveredEvent;
    recoveredEvent = {};
    TEST_ASSERT_TRUE(Esp32BaseAppEvents::readLatest(0, 1, captureEvent, &recoveredEvent));
    TEST_ASSERT_EQUAL(static_cast<int>(Esp32BaseAppEvents::EventKind::ConditionActivated),
                      static_cast<int>(recoveredEvent.eventKind));
    TEST_ASSERT_EQUAL_UINT8(3, recoveredEvent.conditionId);
    static char title[64]{};
    static Esp32BaseAppEvents::EventRecord presentation{};
    title[0] = '\0';
    presentation = {};
    presentation.eventCode = recoveredEvent.eventCode;
    presentation.eventKind = recoveredEvent.eventKind;
    IrrigationEvents::formatTitle(presentation, title, sizeof(title));
    TEST_ASSERT_EQUAL_STRING("设备时间发生倒退", title);

    constexpr uint32_t eventCodes[] = {1001, 1002, 1003, 1004, 1006, 1009, 1101,
                                       1102, 1103, 1104, 1201, 1202, 1203};
    for (const uint32_t eventCode : eventCodes) {
        Esp32BaseAppEvents::EventRecord sample{};
        sample.eventCode = eventCode;
        sample.objectId = 1;
        sample.reasonCode = eventCode == 1001 ? 1U :
                            eventCode == 1002 ? 201U :
                            eventCode == 1003 ? 211U :
                            eventCode == 1201 ? 5U :
                            eventCode == 1009 ? 405U : 0U;
        char sampleTitle[96]{};
        char sampleSummary[160]{};
        IrrigationEvents::formatTitle(sample, sampleTitle, sizeof(sampleTitle));
        IrrigationEvents::formatSummary(sample, sampleSummary, sizeof(sampleSummary));
        TEST_ASSERT_NOT_EQUAL(0, sampleTitle[0]);
        TEST_ASSERT_NOT_EQUAL(0, sampleSummary[0]);
        TEST_ASSERT_NOT_EQUAL(0, std::strcmp("未知事件", sampleTitle));
        TEST_ASSERT_NOT_EQUAL(0, std::strcmp("没有可用的业务说明。", sampleSummary));
    }

    TEST_ASSERT_TRUE(Esp32BaseAppEvents::clearEventHistory());
    TEST_ASSERT_TRUE(Esp32BaseAppEvents::forgetAllConditionStates());

    removeTestStore(g_mainStore);
    removeTestStore(g_rotationStore);
    removeTestStore(g_damageStore);
}

void test_scheduler_state_nvs_round_trip_and_corruption_detection() {
    WateringSchedulerStore store;
    TEST_ASSERT_TRUE(store.clear());
    WateringSchedulerPersistentState state{};
    TEST_ASSERT_EQUAL(static_cast<int>(SchedulerStorageLoadResult::Missing),
                      static_cast<int>(store.load(state)));

    state.mode = AutomaticWateringMode::PausedUntil;
    state.resumeAtEpoch = 1767200400UL;
    state.currentLocalDay = 20454;
    state.currentProcessedMask = 0x80000001UL;
    state.previousLocalDay = 20453;
    state.previousProcessedMask = 0x00000002UL;

    uint8_t encodedWithoutMarker[WateringSchedulerStateCodec::kEncodedSize]{};
    TEST_ASSERT_TRUE(WateringSchedulerStateCodec::encode(
        state, encodedWithoutMarker, sizeof(encodedWithoutMarker)));
    TEST_ASSERT_TRUE(Esp32BaseConfig::setBlob("irrigation",
                                             "sched_state",
                                             encodedWithoutMarker,
                                             sizeof(encodedWithoutMarker)));
    WateringSchedulerPersistentState loadedWithoutMarker{};
    TEST_ASSERT_EQUAL(static_cast<int>(SchedulerStorageLoadResult::Loaded),
                      static_cast<int>(store.load(loadedWithoutMarker)));
    TEST_ASSERT_EQUAL_UINT32(state.resumeAtEpoch,
                             loadedWithoutMarker.resumeAtEpoch);
    TEST_ASSERT_TRUE(store.clear());

    TEST_ASSERT_TRUE(store.save(state));
    TEST_ASSERT_TRUE(Esp32BaseConfig::getBool("irrigation", "sched_init", false));

    WateringSchedulerPersistentState loaded{};
    TEST_ASSERT_EQUAL(static_cast<int>(SchedulerStorageLoadResult::Loaded),
                      static_cast<int>(store.load(loaded)));
    TEST_ASSERT_EQUAL(static_cast<int>(state.mode), static_cast<int>(loaded.mode));
    TEST_ASSERT_EQUAL_UINT32(state.resumeAtEpoch, loaded.resumeAtEpoch);
    TEST_ASSERT_EQUAL_UINT32(state.currentLocalDay, loaded.currentLocalDay);
    TEST_ASSERT_EQUAL_UINT32(state.currentProcessedMask, loaded.currentProcessedMask);
    TEST_ASSERT_EQUAL_UINT32(state.previousLocalDay, loaded.previousLocalDay);
    TEST_ASSERT_EQUAL_UINT32(state.previousProcessedMask, loaded.previousProcessedMask);

    uint8_t damaged[WateringSchedulerStateCodec::kEncodedSize]{};
    TEST_ASSERT_TRUE(WateringSchedulerStateCodec::encode(state, damaged, sizeof(damaged)));
    damaged[12] ^= 0x01;
    TEST_ASSERT_TRUE(Esp32BaseConfig::setBlob("irrigation",
                                             "sched_state",
                                             damaged,
                                             sizeof(damaged)));
    TEST_ASSERT_EQUAL(static_cast<int>(SchedulerStorageLoadResult::Invalid),
                      static_cast<int>(store.load(loaded)));
    TEST_ASSERT_TRUE(store.clear());
}

void test_alive_checkpoint_waits_for_quiet_interval_and_persists() {
    TEST_ASSERT_TRUE(Esp32BaseConfig::clearNamespace("irrigation"));
    DeviceAliveCheckpoint checkpoint;
    TEST_ASSERT_TRUE(checkpoint.begin());
    Esp32BaseTime::Snapshot now{};
    now.synced = true;
    now.source = Esp32BaseTime::SOURCE_NTP;
    now.epochSec = 1767200000UL;
    checkpoint.handle(now, 1, false, 10);
    TEST_ASSERT_EQUAL_UINT32(0, checkpoint.lastKnownAliveEpoch());
    now.epochSec += 3500U;
    checkpoint.handle(now, 1, false, 11);
    now.epochSec += 3599U;
    checkpoint.handle(now, 1, false, 11);
    TEST_ASSERT_EQUAL_UINT32(0, checkpoint.lastKnownAliveEpoch());
    ++now.epochSec;
    checkpoint.handle(now, 1, false, 11);
    TEST_ASSERT_EQUAL_UINT32(now.epochSec, checkpoint.lastKnownAliveEpoch());

    DeviceAliveCheckpoint reloaded;
    TEST_ASSERT_TRUE(reloaded.begin());
    TEST_ASSERT_EQUAL_UINT32(now.epochSec, reloaded.lastKnownAliveEpoch());
    TEST_ASSERT_TRUE(Esp32BaseConfig::clearNamespace("irrigation"));
}

}  // namespace

void setup() {
    Serial.begin(115200);
    delay(1500);
    UNITY_BEGIN();
    RUN_TEST(test_initialize_base_and_capacity_plan);
    RUN_TEST(test_production_watering_store_definition_loads);
    RUN_TEST(test_iot_record_stream_uses_exact_bounded_capacity);
    RUN_TEST(test_completed_append_latest_page_detail_and_reload);
    RUN_TEST(test_small_store_rotates_oldest_complete_segments);
    RUN_TEST(test_crc_damage_is_reported_and_not_returned);
    RUN_TEST(test_irrigation_event_mapping_and_latest_read);
    RUN_TEST(test_scheduler_state_nvs_round_trip_and_corruption_detection);
    RUN_TEST(test_alive_checkpoint_waits_for_quiet_interval_and_persists);
    UNITY_END();
}

void loop() {
    Esp32Base::handle();
    delay(10);
}
